app/controllers/comments_controller.rb

    def create
        @comment = @post.comments.create(params[:comment].permit(:content))
---
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "comment"], ["post_id", 2], ["user_id", 1], ["created_at", "2017-07-26 17:59:25.236987"], ["updated_at", "2017-07-26 17:59:25.236987"]]

    def destroy
        if current_user.id == @post.user_id
            @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]

    def find_comment
        @comment = @post.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 5], ["id", 5], ["LIMIT", 1]]