app/controllers/posts_controller.rb

  def index
    if !params[:dir].present? && !params[:q].present? && !params[:startdate] && !params[:enddate]
      @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE (title like '%aaa%' or description like '%aaa%' or body like '%aaa%')

  def show
    @post = Post.find(params[:id])
    @comments = Comment.where(post_id: @post).latest
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 ORDER BY "comments"."created_at" DESC