app/controllers/users/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 4 ORDER BY "comments"."created_at" DESC
---
        def show
            @comments = Comment.where(post_id: @post).latest

INSERT INTO "posts" ("title", "body", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "testing"], ["body", "test"], ["description", "test"], ["created_at", "2017-07-26 04:21:13.855902"], ["updated_at", "2017-07-26 04:21:13.855902"]]
---
        def create
            #@post = Post.new(post_params)
            @post = current_user.posts.new(post_params)

            respond_to do |format|
            if @post.save

UPDATE "posts" SET "image_url" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_url", "https://static.pexels.com/photos/176842/pexels-photo-176842.jpeg"], ["updated_at", "2017-07-26 05:45:38.057979"], ["id", 4]]
---
        def update
            respond_to do |format|
                if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
---
        def set_post
            @post = Post.find(params[:id])